Revit 2027 API
DoubleClickOptions.GetAction Method
 Returns the active user's desired action for a particular double-click target.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DoubleClickAction GetAction(
	DoubleClickTarget target
)
Public Function GetAction (
	target As DoubleClickTarget
) As DoubleClickAction
public:
DoubleClickAction GetAction(
	DoubleClickTarget target
)
member GetAction :
        target : DoubleClickTarget -> DoubleClickAction
Parameters
target DoubleClickTarget
 The target to check.
Return Value
DoubleClickAction
 The user's desired action for the specified target.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DoubleClickOptions Class
Autodesk.Revit.UI Namespace